# file:menu.py

def zhujianmian():
    print('+-------------------------------------+') #22
    print("|",'1) 添加学生信息',' '*19,'|')
    print("|",'2) 显示学生信息',' '*19,'|')
    print("|",'3) 删除学生信息',' '*19,'|') #去创建删除学生信息的函数
    print("|",'4) 修改学生成绩',' '*19,'|') #去创建修改学生成绩的函数
    print("|",'5) 按学生成绩高-低显示学生信息'," "*4,'|')
    print("|",'6) 按学生成绩低-高显示学生信息'," "*4,'|')
    print("|",'7) 按学生年龄高-低显示学生信息'," "*4,'|')
    print("|",'8) 按学生年龄低-高显示学生信息'," "*4,'|')
    print("|",'9) 从文件中读取学生数据(si.txt)'," "*3,'|')
    print("|",'10)保存信息到文件(si.txt)'," "*9,'|')
    print("|",'q) 退出系统    ',' '*19,'|')
    print('+-------------------------------------+')