#练习：
	# 写一个程序，打印一个高度为４行的矩形框
	# 	要求输入一个整数，此整数代码为矩形的宽度，
	# 	打印相应宽度的矩形
	# 	如：
	# 		请输入矩形宽度：１０
	# 	打印如下：
	# 	＃＃＃＃＃＃＃＃＃＃
	# 	＃　　　　　　　　＃
	# 	＃　　　　　　　　＃
	# 	＃＃＃＃＃＃＃＃＃＃

x = int(input("请输入矩形的宽度:"))
kd = "#"*x
gd = "#"+(" "*(x-2))+"#"
print(kd)
print(gd)
print(gd)
print(kd)

#老师的：方法1字符串*法拼接
w1 = int(input("请输入矩形的宽度："))
line1 = '#' * w1
print(line1)

line2 = '#' + ' ' * (w1-2) + "#"
print(line2)
print(line2)
print(line1)


# #老师的方法2　直接打印
# w = int(input("请输入矩形的宽度："))

# print('#' * w) #打印第一行
# print('#',' ' * (w-2),'#',sep='')
# print('#',' ' * (w-2),'#',sep='')
# print('#'*w)
#  #里面有空格符必须家ＳＥＰ＝空