# 练习：
# 	１．写一个程序，输入一个字符串，吧字符串的第一个字符和最后一个字符去掉，打印出处理后的字符串
# 	２．输入任意一个字符串，判断这个字符串是否是返回文
# 	回文示例：
# 		上海自来水来时上海
# 		ＡＢＣＣＢＡ
# 		１２８８３１
# 	回文是指中心对称的文字
# 	任意输入一段文字，判断是否是回文



# #1.
# zfc = input("请输入一段字符串:")
# print(zfc[1:len(zfc)-1])

# #2.
# hw = input("请输入一段字符串：")
# hw = hw[::1]+hw[::-1]
# print(hw)
# srhw = input("任意输入一段文字，判断是否回文:")
# if srhw == hw[::-1]:
#     print("是")
# else:
#     print("不是")

# #老师：
# s = input("请输入一段文字：")

# print("去掉头和尾后字符串是：",s[1:-1])

x = input("请输入一段文字：")
x2 = x[::-1]  #将两边字符串反转  
if x == x2:
    print(x,"是回文")
else:
    print(x,'不是回文')