    # ５，打印九九乘法表（需用到循环嵌套）
    # 　1*1＝1
    # 　1*2＝2　2*2＝4
    # 　1*3＝3　2*3＝6  3*3=9
    # 　.................
    # 　1*9＝9...........9*9＝81

# x = 1
# y = 1
# xx = 1

# while y <= 9:
    
#     print('%1d*%1d=%1d'%(x,y,x*y),end="  ")

#     while xx < y:
#         xx += 1
#         print('%1d*%1d=%1d'%(xx,y,xx*y),end='  ')
#     print()
#     xx = 1
#     y += 1

#老师的

# 第一重循环控制行数
y1 = 1
while y1 <= 9:
    # 此处打印一行的内容,每行打印ｙ个乘法
    x1 = 1
    while x1 <= y1:
        # 打印想ｘ＊ｙ的一列数据1
        print('%dx%d=%-2d'%(x1,y1,x1*y1),end=' ')
        x1 += 1
    print()
    y1 += 1