    # ２，写程序用while语句生成如下的字符串，并打印出来
    # 　１）‘ＡＢＣＤ．......ＸＹＺ＇
    # 　２）’ＡａBｂCｃDｄ．......XｘYｙZｚ’

s = '' #此字符串用来累加大写字符
s2 = ''#用来累加大小写字符
i = ord('A')　#i = 65　把Ａ转换为字符串

while i < ord('A')+26:
    a = chr(i)　#用当前编码转换为字母
    s += a　　　#把生成的字符存放在ｓ
    s2 += a　　　#把生成的字符存放在ｓ２
    ch = chr(i+32)　#把大写转化成小写字母，　大写和小写的编码指相差32
    s2 += ch　　　　　#把小写字母存放在ｓ２
    i += 1　　　#大写字母转换的字符串加１
print(s2)
print(s)



s = ' '  #此字符串用来累加大写字符
code = ord('A')   #code = 65
while code < 65+26:
    ch = chr(code)   #用当前编码转为字母
    s += ch  #把生成的字母累加到Ｓ中
    code += 1

print("S=",s)
