    # ４，写程序求：
    # 　1/1　-　1/3　+　1/5　-　1/7　+　.......　+（+-）1/（2*n－1）的和
    # 　１）求当ｎ取1000000时这个算式的和
    # 　１）求当ｎ取1000000时这个算式的和乘４还是多少
    #     （答案：3.1415.....）



s = 0  #累加和

n = 1  #分母   1  -2 + 3 -4 +5 -6 +7 -8 +9 -10 +11


while n <= 1000000:
    if n % 2 == 1:
        s += 1/(2*n-1)
        
    if n % 2 == 0:
        s -= 1/(2*n-1)
        
    n += 1
print("和是:",s)
print("和乘4是：",s*4)


ss = 0

nn = 1    #分母

sign = 1   #符号
while nn <= 1000000:
    ss += sign * 1 / (2*nn-1)
    sign *= -1   #改变符号的正负　　正负得负，　负负得正
    nn += 1
print("和是：",ss)
print("4为的和是：",ss*4)
