# 练习：
#     用ｗｈｉｌｅ语句打印三角形，输入一个整数，表示三角形的宽度和高度，打印出相应的三角形
#     如：
#         请输入三角形的宽度：３
#         １，打印如下三角形
#         *
#         **
#         ***
#         ２，打印如下三角形
#            *
#           **
#          ***
#         ****
#         3,打印如下三角形
#         ****
#          ***
#           **
#            *

w = int(input("请输入三角形的宽度和高度："))

xx = 1

while xx <= w:
    print("*"*xx)
    xx += 1
print("------------------")
x = 1
while x <= w:
    
    kongge = w-x
    print(" "*kongge+"*"*x)
    x += 1

print("`````````````````````")
xx = w 
while xx > 0:
    print("*"*xx)
    xx -= 1

print("++++++++++++++++++++++++")

x2 = w
x3 = 0
while x2 > 0:
    print(" "*x3+"*"*x2)
    x3 += 1
    x2 -= 1
     